In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    'city':['New York','London','paris','Tokyo','New York','Paris'],
    'price':[700,150,300,250,180,320]
})

In [3]:
df

       city  price
0  New York    700
1    London    150
2     paris    300
3     Tokyo    250
4  New York    180
5     Paris    320

In [10]:
mean_price = df.groupby('city')['price'].mean().to_dict()

In [11]:
mean_price

{'London': 150.0,
 'New York': 440.0,
 'Paris': 320.0,
 'Tokyo': 250.0,
 'paris': 300.0}

In [12]:
df['city_encoded'] = df['city'].map(mean_price)

In [13]:
df

       city  price  city_encoded
0  New York    700         440.0
1    London    150         150.0
2     paris    300         300.0
3     Tokyo    250         250.0
4  New York    180         440.0
5     Paris    320         320.0

In [14]:
import seaborn as sns

In [15]:
df = sns.load_dataset('flights')

     year month  passengers
0    1949   Jan         112
1    1949   Feb         118
2    1949   Mar         132
3    1949   Apr         129
4    1949   May         121
..    ...   ...         ...
139  1960   Aug         606
140  1960   Sep         508
141  1960   Oct         461
142  1960   Nov         390
143  1960   Dec         432

[144 rows x 3 columns]

In [16]:
df.cov()

                     price  city_encoded
price         39626.666667  12586.666667
city_encoded  12586.666667  12586.666667